article/lang/ocilib.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C语言连接Oracle数据库（使用ocilib库）</title>
<!-- 2016-12-05 Mon 15:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="[[mailto:pengwenbin7@126.com][pengwenbin7]]pengwenbin7" />
<meta name="viewport" content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
<link href="http://cdn.bootcss.com/bootstrap/3.3.6/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" href="https://pengwenbin7.github.io/static/css/article.css">
</head>
<body>
<div id="content">
<h1 class="title">C语言连接Oracle数据库（使用ocilib库）</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 数据库信息</a></li>
<li><a href="#sec-2">2. 初始化环境</a></li>
<li><a href="#sec-3">3. 连接数据库</a></li>
<li><a href="#sec-4">4. 新建表</a></li>
<li><a href="#sec-5">5. 增加三条记录</a></li>
<li><a href="#sec-6">6. 查看</a></li>
<li><a href="#sec-7">7. 删除/修改一条记录</a></li>
<li><a href="#sec-8">8. 清除环境</a></li>
<li><a href="#sec-9">9. 简单示例</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 数据库信息</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
[db]
type=oracle
url=192.168.1.101
port=1521
db=XE
user=admin
pass=admin
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 初始化环境</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-c">OCI_EXPORT boolean <span style="color: #34cae2;">OCI_API</span> <span style="color: #00ede1; font-weight: bold;">OCI_Initialize</span>(
    <span style="color: #34cae2;">POCI_ERROR</span> <span style="color: #dbdb95;">err_handler</span>,
    <span style="color: #ffad29; font-weight: bold;">const</span> <span style="color: #34cae2;">otext</span> *<span style="color: #dbdb95;">lib_path</span>,
    <span style="color: #34cae2;">unsigned</span> <span style="color: #34cae2;">int</span> <span style="color: #dbdb95;">mode</span> 
)
</pre>
</div>
<p>
err_handler错误处理, lib_path定义库的位置，都是可选的。
</p>

<pre class="example">
mode:
    OCI_ENV_DEFAULT : default mode
    OCI_ENV_THREADED : multi-threading support
    OCI_ENV_CONTEXT : thread contextual error handling
    OCI_ENV_EVENTS : enables events for subscription, HA Events, AQ notifications
</pre>

<p>
当前环境对应代码为：
</p>
<div class="org-src-container">

<pre class="src src-c">OCI_Initialize(<span style="color: #008b8b;">NULL</span>, <span style="color: #008b8b;">NULL</span>, OCI_ENV_DEFAULT);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 连接数据库</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-c">OCI_EXPORT <span style="color: #34cae2;">OCI_Connection</span>* <span style="color: #00ede1; font-weight: bold;">OCI_API</span> OCI_ConnectionCreate(
                <span style="color: #ffad29; font-weight: bold;">const</span> <span style="color: #34cae2;">otext</span> *   <span style="color: #dbdb95;">db</span>,
                <span style="color: #ffad29; font-weight: bold;">const</span> <span style="color: #34cae2;">otext</span> *   <span style="color: #dbdb95;">user</span>,
                <span style="color: #ffad29; font-weight: bold;">const</span> <span style="color: #34cae2;">otext</span> *   <span style="color: #dbdb95;">pwd</span>,
                <span style="color: #34cae2;">unsigned</span> <span style="color: #34cae2;">int</span>    <span style="color: #dbdb95;">mode</span> 
)
</pre>
</div>

<p>
*db可简单写为：
</p>
<pre class="example">
"ip:port/instance"
</pre>
<p>
在当前环境下是：
</p>
<pre class="example">
"192.168.1.101:1521/XE"
</pre>


<pre class="example">
Possible values for parameter mode :
    OCI_SESSION_DEFAULT
    OCI_SESSION_SYSDBA
    OCI_SESSION_SYSOPER
    OCI_SESSION_XA
</pre>

<p>
得到数据库连接：
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #34cae2;">OCI_Connection</span> *<span style="color: #dbdb95;">cn</span> = OCI_ConnectionCreate(
<span style="color: #e67128;">"192.168.1.101:1521/XE"</span>,
<span style="color: #e67128;">"admin"</span>,
<span style="color: #e67128;">"admin"</span>,
OCI_SESSION_DEFAULT
);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 新建表</h2>
<div class="outline-text-2" id="text-4">
<p>
接下来需要一个OCI_Statement对象用于执行SQL语句（OCI_Statement也可以执行PL/SQL块）
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #34cae2;">OCI_Statement</span> *<span style="color: #dbdb95;">st</span> = OCI_StatementCreate(cn);
</pre>
</div>
<p>
执行SQL语句
</p>
<div class="org-src-container">

<pre class="src src-c">OCI_ExecuteStmt(st, <span style="color: #e67128;">"create table t01 (id int, name varchar(20))"</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 增加三条记录</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
OCI_ExecuteStmt(st, "insert into t01 values (1, 'One')");
OCI_ExecuteStmt(st, "insert into t01 values (2, 'Two)");
OCI_ExecuteStmt(st, "insert into t01 values (3, 'Three')");
</pre>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 查看</h2>
<div class="outline-text-2" id="text-6">
<p>
从OCI_Resultset对象中取得返回结果，并遍历之
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #34cae2;">OCI_Resultset</span> *<span style="color: #dbdb95;">rs</span> = OCI_GetResultset(st);
<span style="color: #ffad29; font-weight: bold;">while</span> (OCI_FetchNext(rs)) {
    printf(<span style="color: #e67128;">"%d\t%s\n"</span>, OCI_GetInt(rs, 1), OCI_GetString(rs, 2));
}
</pre>
</div>
<p>
注意：
</p>
<pre class="example">
Column position starts at 1.
</pre>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 删除/修改一条记录</h2>
<div class="outline-text-2" id="text-7">
<p>
除了查看，其他操作都需要提交改变，否则改动只对当前运行时有效
</p>
<div class="org-src-container">

<pre class="src src-c">OCI_Commit(cn); <span style="color: #74af68;">// </span><span style="color: #74af68;">&#25552;&#20132;&#21464;&#26356;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 清除环境</h2>
<div class="outline-text-2" id="text-8">
<p>
最后，执行
</p>
<div class="org-src-container">

<pre class="src src-c">OCI_Cleanup();
</pre>
</div>
<p>
清空ORACLE环境
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 简单示例</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #e67128;">/**</span>
<span style="color: #e67128;"> * ocilib simple code</span>
<span style="color: #e67128;"> * </span><span style="color: #008b8b;">@author</span><span style="color: #e67128;"> pengwenbin7</span><span style="color: #008b8b;">@126</span><span style="color: #e67128;">.com</span>
<span style="color: #e67128;"> * </span><span style="color: #008b8b;">@filename</span><span style="color: #e67128;"> main.c</span>
<span style="color: #e67128;"> * </span><span style="color: #008b8b;">@compile</span><span style="color: #e67128;"> gcc main.c -locilib -o main</span>
<span style="color: #e67128;"> */</span>
<span style="color: #23d7d7;">#include</span> <span style="color: #e67128;">&lt;stdio.h&gt;</span>
<span style="color: #23d7d7;">#include</span> <span style="color: #e67128;">&lt;stdlib.h&gt;</span>
<span style="color: #23d7d7;">#include</span> <span style="color: #e67128;">&lt;ocilib.h&gt;</span>

<span style="color: #34cae2;">int</span> <span style="color: #00ede1; font-weight: bold;">main</span>(<span style="color: #34cae2;">int</span> <span style="color: #dbdb95;">argc</span>, <span style="color: #34cae2;">char</span> **<span style="color: #dbdb95;">argv</span>)
{
  <span style="color: #34cae2;">OCI_Connection</span> *<span style="color: #dbdb95;">cn</span>;
  <span style="color: #34cae2;">OCI_Statement</span>  *<span style="color: #dbdb95;">st</span>;
  <span style="color: #34cae2;">OCI_Resultset</span> *<span style="color: #dbdb95;">rs</span>;

  <span style="color: #74af68;">// </span><span style="color: #74af68;">init env</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> (!OCI_Initialize(<span style="color: #008b8b;">NULL</span>, <span style="color: #008b8b;">NULL</span>, OCI_ENV_DEFAULT)) {
    fprintf(stderr, <span style="color: #e67128;">"connect error"</span>);
    <span style="color: #ffad29; font-weight: bold;">return</span> EXIT_FAILURE;
  }

  <span style="color: #74af68;">// </span><span style="color: #74af68;">connect oracle xe</span>
  <span style="color: #ffad29; font-weight: bold;">const</span> <span style="color: #34cae2;">char</span> *<span style="color: #dbdb95;">db</span> = <span style="color: #e67128;">"192.168.1.101:1521/XE"</span>,
    *<span style="color: #dbdb95;">user</span> = <span style="color: #e67128;">"admin"</span>,
    *<span style="color: #dbdb95;">pass</span> = <span style="color: #e67128;">"admin"</span>;
  <span style="color: #ffad29; font-weight: bold;">const</span> <span style="color: #34cae2;">int</span> <span style="color: #dbdb95;">mode</span> = OCI_SESSION_DEFAULT;
  cn = OCI_ConnectionCreate(db, user, pass, mode);

  <span style="color: #74af68;">// </span><span style="color: #74af68;">get OCI_Statement object</span>
  st = OCI_StatementCreate(cn);

  <span style="color: #74af68;">// </span><span style="color: #74af68;">execute sql statement</span>
  OCI_ExecuteStmt(st,
                  <span style="color: #e67128;">"create table t01 (id int, name varchar(20))"</span>
                  );
  OCI_ExecuteStmt(st,
                  <span style="color: #e67128;">"insert into t01 values (1, 'xl')"</span>
                  );
  OCI_ExecuteStmt(st,
                  <span style="color: #e67128;">"insert into t01 values (2, 'haha')"</span>
                  );
  OCI_ExecuteStmt(st,
                  <span style="color: #e67128;">"insert into t01 values (3, 'gogo')"</span>
                  );
  OCI_ExecuteStmt(st,
                  <span style="color: #e67128;">"update t01 set name = 'xxxxx' where id = 2"</span>
                  );
  OCI_ExecuteStmt(st,
                  <span style="color: #e67128;">"delete from t01 where id = 3"</span>
                  );
  OCI_ExecuteStmt(st,
                  <span style="color: #e67128;">"select * from t01"</span>
                  );

  <span style="color: #74af68;">// </span><span style="color: #74af68;">get result</span>
  rs = OCI_GetResultset(st);
  <span style="color: #ffad29; font-weight: bold;">while</span> (OCI_FetchNext(rs)) {
    printf(<span style="color: #e67128;">"%d\t%s\n"</span>, OCI_GetInt(rs, 1), OCI_GetString(rs, 2));
  }
  <span style="color: #74af68;">// </span><span style="color: #74af68;">getColumnCount retrieve the number of rows fetched so far</span>
  <span style="color: #34cae2;">unsigned</span> <span style="color: #34cae2;">int</span> <span style="color: #dbdb95;">row</span> = OCI_GetRowCount(rs),
    <span style="color: #dbdb95;">column</span> = OCI_GetColumnCount(rs);
  printf(<span style="color: #e67128;">"resultset size: %u x %u\n"</span>, row, column);

  <span style="color: #74af68;">// </span><span style="color: #74af68;">commit update</span>
  OCI_Commit(cn);
  <span style="color: #74af68;">// </span><span style="color: #74af68;">clean up</span>
  OCI_Cleanup();
  <span style="color: #ffad29; font-weight: bold;">return</span> EXIT_SUCCESS;
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="mailto:pengwenbin7@126.com">pengwenbin7</a></p>
<p class="date">Created: 2016-12-05 Mon 15:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
